In [1]:
import numpy as np 
import pandas as pd

# Creating a DataFrame

In [ ]:
data = {
    'Name' : ['Alice', 'Bob', 'Charlie', 'David'],
    'Age' : [24, 27, 22, 32],
    'City' : ['New York', 'Los Angeles', 'Chicago', 'Houston'],
    'Salary' : [70000, 80000, 60000, 90000]
}
df = pd.DataFrame(data) # Create DataFrame from dictionary 
df

      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   60000
3    David   32      Houston   90000

In [7]:
data_list = [
    ['Alice', 24, 'New York', 70000],
    ['Bob', 27, 'Los Angeles', 80000],
    ['Charlie', 22, 'Chicago', 60000],
    ['David', 32, 'Houston', 90000]
]

df2 = pd.DataFrame(data_list)
df2

         0   1            2      3
0    Alice  24     New York  70000
1      Bob  27  Los Angeles  80000
2  Charlie  22      Chicago  60000
3    David  32      Houston  90000

In [8]:
columns = ['Name', 'Age', 'City', 'Salary']
df2 = pd.DataFrame(data_list, columns=columns)
df2

      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   60000
3    David   32      Houston   90000

### Selection and indexing of Columns

In [9]:
df2

      Name  Age         City  Salary
0    Alice   24     New York   70000
1      Bob   27  Los Angeles   80000
2  Charlie   22      Chicago   60000
3    David   32      Houston   90000

In [10]:
df2[['Name', 'Salary']]

      Name  Salary
0    Alice   70000
1      Bob   80000
2  Charlie   60000
3    David   90000

### creating a new column

In [11]:
df2["Designation"] = ['Engineer', 'Doctor', 'Artist', 'Lawyer']
df2

      Name  Age         City  Salary Designation
0    Alice   24     New York   70000    Engineer
1      Bob   27  Los Angeles   80000      Doctor
2  Charlie   22      Chicago   60000      Artist
3    David   32      Houston   90000      Lawyer

### Removing Columns and Rows

In [13]:
df2.drop(0, axis=0)  # Removing row with index 0

      Name  Age         City  Salary Designation
1      Bob   27  Los Angeles   80000      Doctor
2  Charlie   22      Chicago   60000      Artist
3    David   32      Houston   90000      Lawyer

In [ ]:
df2

      Name  Age         City  Salary Designation
0    Alice   24     New York   70000    Engineer
1      Bob   27  Los Angeles   80000      Doctor
2  Charlie   22      Chicago   60000      Artist
3    David   32      Houston   90000      Lawyer

In [16]:
df2.loc[[0,1]]  # Selecting rows with index 0 and 1

    Name  Age         City  Salary Designation
0  Alice   24     New York   70000    Engineer
1    Bob   27  Los Angeles   80000      Doctor

In [17]:
df.iloc[3]  # Selecting row with index 3

Name        David
Age            32
City      Houston
Salary      90000
Name: 3, dtype: object

Selecting Subsets of Rows and Columns

In [18]:

df.loc[[0,1]][["City","Salary"]] # Selecting 'City' and 'Salary' columns for rows with index 0 and 1

          City  Salary
0     New York   70000
1  Los Angeles   80000


Conditional Selection

In [19]:
df2

      Name  Age         City  Salary Designation
0    Alice   24     New York   70000    Engineer
1      Bob   27  Los Angeles   80000      Doctor
2  Charlie   22      Chicago   60000      Artist
3    David   32      Houston   90000      Lawyer

In [20]:
# i only want to see those people whose age is above 30

df2[df2["Age"] > 30]

    Name  Age     City  Salary Designation
3  David   32  Houston   90000      Lawyer

In [22]:
#I only want poeple whose age is above 22 and their city must be new york
df2[(df2["Age"] > 22) & (df2["City"] == "New York")]

    Name  Age      City  Salary Designation
0  Alice   24  New York   70000    Engineer